Repository: interfrog/if_themeconfiguration
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_ifthemeconfiguration_domain_model_themeconfiguration.hash
source: ifPage Validate-Key
de: ifPage Validierungs-Code

# tx_ifthemeconfiguration_domain_model_themeconfiguration.table
source: Themeconfigurations
de: Theme-Konfigurationen

# tx_ifthemeconfiguration_domain_model_themeconfiguration.theme.empty
source: -- CHOOSE INSTALLED TEMPLATE --
de: -- Bitte wählen --

# tx_ifthemeconfiguration_domain_model_themeconfiguration.scssfile
source: SCSS-File with color config (generated)
de: SCSS-File mit Farbkonfiguration (generiert)

# tx_ifthemeconfiguration_domain_model_themeconfiguration.cssfile
source: CSS-File with theme styles (compiled)
de: CSS-Datei (kompiliert)

# tx_ifthemeconfiguration_domain_model_themeconfiguration.color
source: color
de: Farbe

# tx_ifthemeconfiguration_domain_model_themeconfiguration.emptycolor
source: -- Choose Color --
de: -- Bitte wählen --

# tx_ifthemeconfiguration_domain_model_themeconfiguration.font
source: Font
de: Schriftart

# tx_ifthemeconfiguration_domain_model_themeconfiguration.emptyfont
source: -- Choose Font --
de: -- Bitte wählen --

# tx_ifthemeconfiguration_domain_model_themeconfiguration.fontstyle
source: Fontstyle
de: Schrift-Stil

# tx_ifthemeconfiguration_domain_model_themeconfiguration.fontstyle.normal
source: normal (Default)
de: normal (Standard)

# tx_ifthemeconfiguration_domain_model_themeconfiguration.fontstyle.italic
source: italic
de: kursiv

# tx_ifthemeconfiguration_domain_model_themeconfiguration.fontweight
source: Fontweight
de: Schrift-Dicke

# tx_ifthemeconfiguration_domain_model_themeconfiguration.fontweight.400
source: 400 - Normal (DEFAULT)
de: 400 - Normal (Standard)

# tx_ifthemeconfiguration_domain_model_themeconfiguration.colorshemes
source: Colorshemes
de: Farbschema

# tx_ifthemeconfiguration_domain_model_themeconfiguration.label.general
source: General
de: Allgemeines

# tx_ifthemeconfiguration_domain_model_themeconfiguration.label.generated
source: Generated
de: Erzeugte Dateien

# tx_ifthemeconfiguration_domain_model_themeconfiguration.label.colorshemes
source: Colorshemes
de: Farbschema

# tx_ifthemeconfiguration_domain_model_color.table
source: Colors
de: Farben

# tx_ifthemeconfiguration_domain_model_color.red
source: Red
de: Rot

# tx_ifthemeconfiguration_domain_model_color.green
source: Green
de: Grün

# tx_ifthemeconfiguration_domain_model_color.blue
source: Blue
de: Blau

# tx_ifthemeconfiguration_domain_model_color.opacity
source: Opacity as %
de: Deckkraft in %

# tx_ifthemeconfiguration_domain_model_color.hex
source: Hex-value
de: Hex-Wert

# tx_ifthemeconfiguration_domain_model_color.label.opacity
source: Opacity
de: Deckkraft

# tx_ifthemeconfiguration_domain_model_font.div.general
source: General
de: Allgemein

# tx_ifthemeconfiguration_domain_model_font.div.google
source: Google-Config
de: Google-Konfiguration

# tx_ifthemeconfiguration_domain_model_font.div.bold
source: Bold
de: Fett

# tx_ifthemeconfiguration_domain_model_font.div.italic
source: Italic
de: Kursiv

# tx_ifthemeconfiguration_domain_model_font.div.bolditalic
source: Bold-Italic
de: Fett-Kursiv

# tx_ifthemeconfiguration_domain_model_font.table
source: External-Fonts
de: Externe Schriften

# tx_ifthemeconfiguration_domain_model_font.url
source: URL to Google Font
de: URL der Google Font

# tx_ifthemeconfiguration_domain_model_font.fontfamily
source: CSS font-family value
de: CSS font-family Einstellung

# tx_ifthemeconfiguration_domain_model_font.fonttype
source: Font-Type
de: Schrift-Typ

# tx_ifthemeconfiguration_domain_model_font.fonttype.static
source: Static (@fontface)
de: Statisch (@fontface)

# tx_ifthemeconfiguration_domain_model_font.ttf
source: ttf file (absolute Path)
de: ttf Datei (absoluter Pfad)

# tx_ifthemeconfiguration_domain_model_font.woff
source: woff file (absolute Path)
de: woff Datei (absoluter Pfad)

# tx_ifthemeconfiguration_domain_model_font.eot
source: eot file (absolute Path)
de: eot Datei (absoluter Pfad)

# tx_ifthemeconfiguration_domain_model_font.svg
source: svg file (absolute Path)
de: svg Datei (absoluter Pfad)

# tx_ifthemeconfiguration_domain_model_colorsheme.table
source: Colorsheme
de: Farbschema

# tx_ifthemeconfiguration_domain_model_colorsheme.label.general
source: General
de: Allgemein

# tx_ifthemeconfiguration_domain_model_colorsheme.label.colordefinition
source: Color definition
de: Farbdefinition

# tx_ifthemeconfiguration_domain_model_colorsheme.palette.text
source: Text colors
de: Textfarben

# tx_ifthemeconfiguration_domain_model_colorsheme.theme.empty
source: -- CHOOSE INSTALLED TEMPLATE --
de: -- Bitte wählen --

# tx_ifthemeconfiguration_domain_model_colorsheme.identifier
source: Unique Identifier (value of data attribute)
de: Eindeutiger Identifier (wert für das data Attribut)

# tx_ifthemeconfiguration_domain_model_colorsheme.backgroundcolor
source: Background-Color
de: Hintergrund-Farbe

# tx_ifthemeconfiguration_domain_model_colorsheme.headercolor
source: Header-Color
de: Farbe der Überschriften

# tx_ifthemeconfiguration_domain_model_colorsheme.textcolor
source: Text-Color
de: Farbe des Textes

# tx_ifthemeconfiguration_domain_model_colorsheme.linkcolor
source: Link-Color
de: Farbe der Links

# tx_ifthemeconfiguration_domain_model_colorsheme.linkhovercolor
source: Link-Hover-Color
de: Farbe des Link-Hover

# tt_content.colorsheme
source: Colorsheme
de: Farb-Schema

# tt_content.colorsheme.empty
source: Default
de: Standard (keins)
